/*******************************************************************************
*   文件名称 : DiskinfoApp.h
*   作    者 : 王全宝
*   创建时间 : 2015/9/12   15:59
*   文件描述 : 
*   版权声明 : Copyright (C) 2014-2015 湖南安存科技有限公司
*   修改历史 : 2015/9/12   1.00 初始版本
*******************************************************************************/
#pragma once

#include <stddef.h>
#include <stdio.h>
#include <string.h>
#include <iostream>
#include "IDiskInfo.h"
using namespace std;

class CDiskinfoApp
{
public:

    /*******************************************************************************
    * 函数名称  : Init
    * 函数描述  : N/A
    * 参数      : int argc
    * 参数      : char * argv[]
    * 返回值    : void
    * 备注      : N/A
    * 修改日期     修改人   修改内容
    * -----------------------------------------------
    * 2015/9/12   王全宝   新建
    *******************************************************************************/
    int Init(int argc, char *argv[]);

    /*******************************************************************************
    * 函数名称  : Run
    * 函数描述  : N/A
    * 返回值    : void
    * 备注      : N/A
    * 修改日期     修改人   修改内容
    * -----------------------------------------------
    * 2015/9/12   王全宝   新建
    *******************************************************************************/
    void Run();
public:
    /*******************************************************************************
    * 函数名称  : GetInstance
    * 函数描述  : 单实例类获取接口
    * 返回值    : CDiskinfoApp*
    * 备注      : N/A
    * 修改日期     修改人   修改内容
    * -----------------------------------------------
    * 2015/9/12   王全宝   新建
    *******************************************************************************/
    static CDiskinfoApp* GetInstance();

    /*******************************************************************************
    * 函数名称  : ReleaseInstance
    * 函数描述  : 单实例释放
    * 返回值    : void
    * 备注      : N/A
    * 修改日期     修改人   修改内容
    * -----------------------------------------------
    * 2015/9/12   王全宝   新建
    *******************************************************************************/
    static void ReleaseInstance();

protected:
    CDiskinfoApp();
    ~CDiskinfoApp();

private:
    static CDiskinfoApp*       m_pInstance;
    IDiskInfo*                 m_pDiskInfo;
};

