/*******************************************************************************
*   文件名称 : IDiskInfo.h
*   作    者 : 王全宝
*   创建时间 : 2015/9/12   15:23
*   文件描述 : 磁盘信息接口类
*   版权声明 : Copyright (C) 2014-2015 湖南安存科技有限公司
*   修改历史 : 2015/9/12   1.00 初始版本
*******************************************************************************/

#pragma once

#include "tDiskInfo.h"
#include "EasyLog.h"
#include "IniFile.h"
#include "CommFunc.h"
#include "json/json.h"
#include <sstream>
#include <map>
#include <vector>
#include <stdlib.h>
#include <stdio.h>
#include <string.h>
using std::map;
using std::vector;

//获取磁盘信息虚接口定义
class IDiskInfo
{
public:
    /*******************************************************************************
    * 函数名称  : IDiskInfo
    * 函数描述  : N/A
    * 返回值    : 
    * 备注      : N/A
    * 修改日期     修改人   修改内容
    * -----------------------------------------------
    * 2015/9/12   王全宝   新建
    *******************************************************************************/
    IDiskInfo();

    /*******************************************************************************
    * 函数名称  : ~IDiskInfo
    * 函数描述  : N/A
    * 返回值    : 
    * 备注      : N/A
    * 修改日期     修改人   修改内容
    * -----------------------------------------------
    * 2015/9/12   王全宝   新建
    *******************************************************************************/
    virtual ~IDiskInfo();

    /*******************************************************************************
    * 函数名称  : Init
    * 函数描述  : N/A
    * 参数      : int argc
    * 参数      : char * argv[]
    * 返回值    : void
    * 备注      : N/A
    * 修改日期     修改人   修改内容
    * -----------------------------------------------
    * 2015/10/09   王全宝   新建
    *******************************************************************************/
    virtual void Init(int argc, char *argv[]) = 0;

    /*******************************************************************************
    * 函数名称  : GetDiskInfo
    * 函数描述  : 获取磁盘信息，纯虚函数，在派生类中实现
    * 返回值    : int
    * 备注      : N/A
    * 修改日期     修改人   修改内容
    * -----------------------------------------------
    * 2015/9/14   王全宝   新建
    *******************************************************************************/
    virtual int GetDiskInfo() = 0;

    /*******************************************************************************
    * 函数名称  : DiskInfoToJson
    * 函数描述  : 将磁盘信息转换为json字符串
    * 参数      : string & strJson
    * 返回值    : int
    * 备注      : N/A
    * 修改日期     修改人   修改内容
    * -----------------------------------------------
    * 2015/9/14   王全宝   新建
    *******************************************************************************/
    virtual int DiskInfoToJson(string& strJson) = 0;

	/*******************************************************************************
	* * 函数名称  : syscmd_result
	* * 函数描述  : 执行shell命令，并返回执行结果。
	* * 输入参数  : char* cmd     : 要执行的shell命令
	*               char* retinfo ：用于保存执行shell命令的结果
	* * 输出参数  : char* retinfo ：shell命令的结果
	* * 返回值    : 0:success  other:failed
	* * 备注      : N/A
	* * 修改日期     修改人   修改内容
	* * -----------------------------------------------
	* * 2015/10/12    郭家勇   新建
	* *******************************************************************************/
	int syscmd_result(char* cmd, std::vector<std::string>& resvec);

	int syscmd_result(char* cmd, string& resvec);

protected:
	map<string, map<string, tDiskInfo*>* > m_mapAdatInfo; 
	map<string, tDiskInfo*>       m_mapDiskInfo; //磁盘信息数组
	string                        m_strRow; //磁盘阵列行数
	string                        m_strColumn; //磁盘阵列列数
	string                        m_strRaidtype; //RAID类型
	string                        m_strMode; //机器型号
	vector<string>				  m_vecAllDisk;
	int                           m_intRetCode;
};

