/*******************************************************************************
*   文件名称 : SataDisk.cpp
*   作    者 : 王全宝
*   创建时间 : 2015/10/9   10:29
*   文件描述 : 
*   版权声明 : Copyright (C) 2014-2015 湖南安存科技有限公司
*   修改历史 : 2015/10/9   1.00 初始版本
*******************************************************************************/


#include "SataDisk.h"



/*******************************************************************************
* 函数名称  : CSataDisk
* 函数描述  : N/A
* 参数      : tDiskInfo * pDiskInfo
* 参数      : string & strInfo
* 返回值    : 
* 备注      : N/A
* 修改日期     修改人   修改内容
* -----------------------------------------------
* 2015/10/09   王全宝   新建
*******************************************************************************/
CSataDisk::CSataDisk()
{
}


/*******************************************************************************
* 函数名称  : ~CSataDisk
* 函数描述  : N/A
* 返回值    : 
* 备注      : N/A
* 修改日期     修改人   修改内容
* -----------------------------------------------
* 2015/10/09   王全宝   新建
*******************************************************************************/
CSataDisk::~CSataDisk()
{
}

/*******************************************************************************
* 函数名称  : GetDiskInfo
* 函数描述  : N/A
* 参数      : tDiskInfo * pDiskInfo
* 参数      : string & strInfo
* 返回值    : int
* 备注      : N/A
* 修改日期     修改人   修改内容
* -----------------------------------------------
* 2015/10/09   王全宝   新建
*******************************************************************************/
int CSataDisk::GetDiskInfo(tDiskInfo* pDiskInfo, string& strInfo)
{
	vector<string> diskinfo_vect;
	string get_diskinfo_cmd = "";
}
